[
    {
        "name": "Lumicat",
        "description": "Lumicat is a graceful feline monster known for its ethereal appearance. Its pristine white fur contrasts with the mesmerizing yellow orb embedded in its belly, which emits a soft, soothing glow. Lumicat is a creature of mystery, often associated with lunar phases and dreamlike encounters in moonlit forests. Its gentle nature makes it a favorite among those seeking tranquility and inspiration.",
        "spriteImage": "characters.png",
        "spriteFrame": {
            "x": 0,
            "y": 0,
            "width": 16,
            "height": 16
        },
        "fullImage": "characters.png",
        "fullFrame": {
            "x": 0,
            "y": 16,
            "width": 32,
            "height": 32
        }
    },
    {
        "name": "Arachnoclops",
        "description": "Arachnoclops is a peculiar arachnid-inspired monster characterized by its earthy brown exoskeleton and a singular, unblinking eye. It dwells in dark, labyrinthine caves, where it weaves intricate webs to ensnare its prey. Despite its unsettling appearance, Arachnoclops is known for its keen perception, using its solitary eye to sense even the faintest vibrations in its subterranean realm. Many adventurers seek its wisdom, believing it to be the guardian of hidden knowledge buried beneath the earth's surface.",
        "spriteImage": "characters.png",
        "spriteFrame": {
            "x": 16,
            "y": 0,
            "width": 16,
            "height": 16
        },
        "fullImage": "characters.png",
        "fullFrame": {
            "x": 32,
            "y": 16,
            "width": 32,
            "height": 32
        }
    },
    {
        "name": "Insectanose",
        "description": "Insectanose is a fascinating creature with the body of a dark brown caterpillar and a unique, elongated snout reminiscent of an anteater. This remarkable adaptation allows it to probe deep into the forest floor, unearthing hidden treasures of delicious insects and grubs. Insectanose is known for its voracious appetite and plays a vital role in maintaining the ecological balance of its woodland habitat. Its peculiar appearance serves as a testament to nature's ability to evolve remarkable solutions for survival in every corner of the wild.",
        "spriteImage": "characters.png",
        "spriteFrame": {
            "x": 32,
            "y": 0,
            "width": 16,
            "height": 16
        },
        "fullImage": "characters.png",
        "fullFrame": {
            "x": 64,
            "y": 16,
            "width": 32,
            "height": 32
        }
    },
    {
        "name": "Luminantis",
        "description": "Luminantis is a striking mantis-inspired monster adorned in pristine white exoskeleton, with a radiant yellow orb nestled within its thorax. This otherworldly creature is a symbol of balance and precision in the natural world. It's often seen as a guardian of the moonlit meadows where it resides, using its keen agility and the mesmerizing glow of its orb to navigate the night. Luminantis is known for its graceful, almost dance-like movements, which have inspired many artists and poets to seek inspiration from its ethereal beauty.",
        "spriteImage": "characters.png",
        "spriteFrame": {
            "x": 64,
            "y": 0,
            "width": 16,
            "height": 16
        },
        "fullImage": "characters.png",
        "fullFrame": {
            "x": 96,
            "y": 16,
            "width": 32,
            "height": 32
        }
    },
    {
        "name": "Vegitoclops",
        "description": "Vegitoclops is a whimsical, vegetable-inspired creature that features a vibrant green, leafy exterior and a single, large eye that sits at the center of its bulbous body. Resembling a walking salad, Vegitoclops thrives in lush gardens and dense jungles where it blends seamlessly with its plant surroundings. It's often mistaken for a mobile shrub until its keen eye suddenly focuses on its surroundings. This creature's unique appearance and harmonious connection to nature make it a symbol of the bountiful and mysterious world of vegetation.",
        "spriteImage": "characters.png",
        "spriteFrame": {
            "x": 48,
            "y": 0,
            "width": 16,
            "height": 16
        },
        "fullImage": "characters.png",
        "fullFrame": {
            "x": 0,
            "y": 48,
            "width": 32,
            "height": 32
        }
    },
    {
        "name": "Toadstare",
        "description": "Toadstare is a hazardous mushroom-themed creature with a single, menacing eye at the center of its cap. Its body is adorned with poisonous hues of purples and greens, warning potential predators of its deadly toxins. Toadstare is often found lurking in the shadowy depths of damp forests, camouflaging among real mushrooms. Its poison, both a defense mechanism and a means of subduing prey, makes it a creature to be approached with utmost caution. This enigmatic monster serves as a reminder of the dangers that can lurk within the beauty of the natural world.",
        "spriteImage": "characters.png",
        "spriteFrame": {
            "x": 80,
            "y": 0,
            "width": 16,
            "height": 16
        },
        "fullImage": "characters.png",
        "fullFrame": {
            "x": 32,
            "y": 48,
            "width": 32,
            "height": 32
        }
    },
    {
        "name": "Spectralocus",
        "description": "Spectralocus is a mysterious, floating creature that appears as a tranquil, translucent blue sphere with a singular, observant eye at its center. Unlike its luminous counterparts, Spectralocus thrives in the calm, serene realms of quiet forests and secluded lakeshores, where moonlight gently bathes its form. Its presence is often associated with moments of tranquility and introspection. Many seekers of solace and meditation find comfort in the silent company of Spectralocus, believing it to be a gentle guardian of secluded, contemplative spaces in the natural world.",
        "spriteImage": "characters.png",
        "spriteFrame": {
            "x": 96,
            "y": 0,
            "width": 16,
            "height": 16
        },
        "fullImage": "characters.png",
        "fullFrame": {
            "x": 64,
            "y": 48,
            "width": 32,
            "height": 32
        }
    },
    {
        "name": "Hexacube",
        "description": "Hexacube is an enigmatic and geometric creature, resembling a foreboding, purple box adorned with striking, yellow vertices that give it a distinctly menacing appearance. This perplexing entity defies the conventional forms found in nature and is often encountered in the heart of ancient, enigmatic ruins and forgotten labyrinths. Hexacube's intimidating countenance conceals its profound wisdom and enigmatic secrets, making it a symbol of the mysteries that lie hidden in the depths of the world. It is said that those who dare to unlock its riddles may gain unparalleled knowledge and power.",
        "spriteImage": "characters.png",
        "spriteFrame": {
            "x": 112,
            "y": 0,
            "width": 16,
            "height": 16
        },
        "fullImage": "characters.png",
        "fullFrame": {
            "x": 96,
            "y": 48,
            "width": 32,
            "height": 32
        }
    }
]
